Tools/src/DataProcessors/ОИМЦ_ВосстановитьДокумент/ОИМЦ_ВосстановитьДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОИМЦ_ВосстановитьДокумент</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ОИМЦ_63_Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаДокументов</name>
    <attributes>
      <name>Ид</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Tools/src/DataProcessors/ОИМЦ_ВосстановитьДокумент/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучитьДанныеНаСервере();
	Для каждого Элемент Из ТипыДокументов Цикл
		Элементы.ТипыДокументов.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление, Элемент.Пометка, Элемент.Картинка);		
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	Объект.ТаблицаДокументов.Очистить();
	ТипыДокументов.Очистить();
	ТЗ = ОИМЦ_Данные.ЗапросДанных63("select ""movementDrug"".all_doc_org(" + Формат(Объект.Организация.ОргИд, "ЧГ=0") + ");");
	Если ТЗ <> Неопределено Тогда
		Для каждого Элемент Из ТЗ Цикл
			МассивСтрок = РазобратьСтроку(Элемент.all_doc_org);
			НС = Объект.ТаблицаДокументов.Добавить();
			НС.Ид = Строка(МассивСтрок[0]);
			НС.Документ = Строка(МассивСтрок[1]);
			Если ТипыДокументов.НайтиПоЗначению(НС.Документ) = Неопределено Тогда
				ТипыДокументов.Добавить(НС.Документ, НС.Документ);
			КонецЕсли; 
			НС.Номер = Строка(МассивСтрок[2]);
			НС.Дата = СтрокаВДату(МассивСтрок[3]);
		КонецЦикла;
	КонецЕсли;
	Объект.ТаблицаДокументов.Сортировать("Дата");
	ТипыДокументов.СортироватьПоЗначению();   
	ТЗ = Объект.ТаблицаДокументов.Выгрузить();
	АдресРезультата = ПоместитьВоВременноеХранилище(ТЗ, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РазобратьСтроку(ИсходнаяСтрока)
	Результат = Новый Массив;
    ИсходнаяСтрока = Сред(ИсходнаяСтрока, 2, СтрДлина(ИсходнаяСтрока) - 2);
	ОткрытаКавычка = Ложь;   	
	НС = "";
	Для Счетчик = 1 По СтрДлина(ИсходнаяСтрока) Цикл
		СимволСтроки = Сред(ИсходнаяСтрока, Счетчик, 1);
		Если (СимволСтроки = Символ(44)) и (НЕ ОткрытаКавычка) Тогда
			Результат.Добавить(НС);
			НС = "";
		ИначеЕсли СимволСтроки = Символ(34) Тогда
			ОткрытаКавычка = НЕ ОткрытаКавычка;
			НС = НС + СимволСтроки;
		Иначе
			НС = НС + СимволСтроки;
		КонецЕсли;
	КонецЦикла;
	Результат.Добавить(НС);
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаВДату(СтрДаты);  // "2025-12-31 00:00:00"
	Г = Сред(СтрДаты, 2, 4);
	М = Сред(СтрДаты, 7, 2);
	Д = Сред(СтрДаты, 10, 2);
	Ч = Сред(СтрДаты, 13, 2);
	Т = Сред(СтрДаты, 16, 2);
	С = Сред(СтрДаты, 19, 2);
	Возврат Дата(Г + М + Д + Ч + Т + С);
КонецФункции

&НаКлиенте
Процедура ТипыДокументовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВыбратьДокументы(ВыбранноеЗначение);  
КонецПроцедуры

&НаСервере
Процедура ВыбратьДокументы(ВыбранноеЗначение)
	Объект.ТаблицаДокументов.Загрузить(ПолучитьИзВременногоХранилища(АдресРезультата));
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Документ", ВыбранноеЗначение);
	Объект.ТаблицаДокументов.Загрузить(Объект.ТаблицаДокументов.Выгрузить(ПараметрыОтбора));
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПоДате(Команда)
	СортировкаПоДатеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПоНомеру(Команда)
	СортировкаПоНомеруНаСервере();
КонецПроцедуры

&НаСервере
Процедура СортировкаПоДатеНаСервере()
	Объект.ТаблицаДокументов.Сортировать("Дата");
КонецПроцедуры

&НаСервере
Процедура СортировкаПоНомеруНаСервере()
	Объект.ТаблицаДокументов.Сортировать("Номер");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТаблицаДокументовВыборНаСервере();    //Элемент.ТекущиеДанные.Ид  4416861
КонецПроцедуры

&НаСервере
Процедура ТаблицаДокументовВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры
